---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarMinLength
source: html/b0f98607-1bb6-b99a-8c17-af5d9353634e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarMinLength Property

"Minimum bar length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarMinLength { get; }
```